# 1. Создать словарь из пар ключ-значение, где ключи - это буквы своей фамилии, а значения - это порядковый номер буквы в алфавите, от которого взят:
# а) факториал (если вы родились весной);
# б) число Фиббоначи (осень);
# в) возведение в третью степень (зима);
# г) основание натурального логарифма ex (лето).
# 2. Отсортировать его по ключу в алфавитном порядке и сохранить в файл.
# 3. Отсортировать по значениям от меньшего к большему и сохранить в файл.
# 4. Для задания 1(а-г) написать функцию-генератор.
# 5. Создать список из значений словаря и разделить его на два: один из значений меньше среднего по списку, второй - среднее и выше.

dict_1 = {'П': 17,'Л': 13,'Ё': 7,'Н': 15,'К': 12,'И': 10,'Н': 15}